In [33]:
import pandas as pd

In [34]:
#in data pre processing fist step is finding null values and filling those with some strategy like mean ,median ,mode and use
#simple imputer for multiple columns
# after this next is converted into the categorical data into numerical data for which we use label encoder, one hot encoding,

In [35]:
df=pd.read_excel("rise dataset.xlsx")

In [36]:
df

        name   age    salary own car      sex
0     sukesh  25.0   20000.0      yes    male
1      ashta  23.0   15000.0       no  female
2      rekha  42.0   90000.0      yes  female
3       mack  20.0   45000.0      yes    male
4     rutika  25.0   90000.0       no  female
5     shweta   NaN   56000.0      yes  female
6    subhash   NaN   66000.0      yes    male
7        sam  26.0   89000.0      yes    male
8   niharika  33.0  125000.0       no  female
9     rahul   29.0   75000.0       no    male
10    akshay  31.0       NaN      NaN    male
11   shubham   NaN       NaN      NaN    male

In [37]:
# #what is data preprocessing = it is processing the raw data and making it suitable for machine learning model  
# 1. handling missing values 
# 2. encoding categorical data 
# 3. feature scaling using min max scaler and standard scaler
# 4. splitting the dataset for training and testing

In [38]:
# missing values handling
#age,salary are numerical columns other are categorical 
df.isnull().sum()

name        0
age         3
salary      2
own car     2
sex         0
dtype: int64

In [39]:
df.isna().sum()

name        0
age         3
salary      2
own car     2
sex         0
dtype: int64

In [40]:
# how to fill values for numerical columns 1. using fillna 2. using simple imputer

In [41]:
# df["age"].fillna(df["age"].mean(), inplace=True)
# df["salary"].fillna(df["salary"].mean(), inplace=True)
# df["xyz"].fillna(df["xyz"].mean(), inplace=True)

In [42]:
#df["age"]=df["age"].astype(int)
#df

In [43]:
#suppose there are multiple columns on which we wan to aply fillna but it time consuming that taking each column
#and writing code so we go for simple imputer

In [44]:
# from sklearn.impute import SimpleImputer
# si=SimpleImputer(strategy="mean") # strategy can be mean median mode and also constant value

In [45]:
# numeric_cols = ['age', 'salary']

In [46]:
# imputed_num_columns=si.fit_transform(num_columns)

from sklearn.impute import SimpleImputer

num_imputer = SimpleImputer(strategy='mean')

df[['age', 'salary']] = num_imputer.fit_transform(df[['age', 'salary']])
print(df)

        name        age    salary own car      sex
0     sukesh  25.000000   20000.0      yes    male
1      ashta  23.000000   15000.0       no  female
2      rekha  42.000000   90000.0      yes  female
3       mack  20.000000   45000.0      yes    male
4     rutika  25.000000   90000.0       no  female
5     shweta  28.222222   56000.0      yes  female
6    subhash  28.222222   66000.0      yes    male
7        sam  26.000000   89000.0      yes    male
8   niharika  33.000000  125000.0       no  female
9     rahul   29.000000   75000.0       no    male
10    akshay  31.000000   67100.0      NaN    male
11   shubham  28.222222   67100.0      NaN    male

In [47]:
df.isnull().sum()

name        0
age         0
salary      0
own car     2
sex         0
dtype: int64

In [48]:
#for categorical data we will use label encoder, we can also use map
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder() # create object of label encoder
df["sex"]=le.fit_transform(df["sex"])
df.sex

0     1
1     0
2     0
3     1
4     0
5     0
6     1
7     1
8     0
9     1
10    1
11    1
Name: sex, dtype: int64

In [49]:
df

        name        age    salary own car   sex
0     sukesh  25.000000   20000.0      yes    1
1      ashta  23.000000   15000.0       no    0
2      rekha  42.000000   90000.0      yes    0
3       mack  20.000000   45000.0      yes    1
4     rutika  25.000000   90000.0       no    0
5     shweta  28.222222   56000.0      yes    0
6    subhash  28.222222   66000.0      yes    1
7        sam  26.000000   89000.0      yes    1
8   niharika  33.000000  125000.0       no    0
9     rahul   29.000000   75000.0       no    1
10    akshay  31.000000   67100.0      NaN    1
11   shubham  28.222222   67100.0      NaN    1

In [50]:
data=pd.DataFrame({"colors":["red","white","yellow","green"]})

In [51]:
data

   colors
0     red
1   white
2  yellow
3   green

In [52]:
from sklearn.preprocessing import OneHotEncoder

In [53]:
ohe = OneHotEncoder()

In [54]:
ohe_data = ohe.fit_transform(data[['colors']])

In [55]:
print(ohe_data)

<Compressed Sparse Row sparse matrix of dtype 'float64'
	with 4 stored elements and shape (4, 4)>
  Coords	Values
  (0, 1)	1.0
  (1, 2)	1.0
  (2, 3)	1.0
  (3, 0)	1.0

In [56]:
one_hot_vectors = pd.get_dummies(data['colors'])
one_hot_vectors

   green    red  white  yellow
0  False   True  False   False
1  False  False   True   False
2  False  False  False    True
3   True  False  False   False

In [57]:
one_hot_vectors.astype(int)

   green  red  white  yellow
0      0    1      0       0
1      0    0      1       0
2      0    0      0       1
3      1    0      0       0

In [58]:
data=pd.DataFrame({"colors":["red","white","yellow","green"]})

In [59]:
label_encoded_data=le.fit_transform(data["colors"])

In [60]:
label_encoded_data

array([1, 2, 3, 0])

In [61]:
data

   colors
0     red
1   white
2  yellow
3   green

In [62]:
# Q. very important question is what is difference between OHE and LE
## Q. what is the use of simple imputer

ies are nominal (no order)
                                                                    #(ex. color

In [63]:
# ##| Feature          | Label Encoding              | One Hot Encoding                 |
# | ---------------- | --------------------------- | -------------------------------- |
#             When the categories have order or ranking         When categories are nominal (no order)
                                                                    #(ex. color, city, gender, country)
                  #(ex., Small < Medium < Large)

# | Output           | Single column with integers | Multiple columns with 0/1        |
#
# | Data Type        | Ordinal or Nominal          | Nominal only                     |
# | Order Introduced | Yes (0 < 1 < 2)             | No (pure binary)                 |
# | Good for         | Tree models(DT,RF)          | Linear, distance & neural models |
# | Issue            | False ranking               | More features created            |

In [64]:
## one hot encoding create sparse matrix of binary numbers 0 and 1 , and label encoding create single columns with integers
## label encoding gives ranking like 1 ,2 3, 45,67, due to which the ML model may get misunderstanding about the importnace of feature
# like suppose there are 20 colors, if color red is coded as 0 and yellow is coded as 20 
#then machine may give more importance to yellow color than red